{
  "translation": {
    "Footer": "Developed © Josue Carvalho",
    "Lang": "Choose a translation",
    "en": "English International",
    "pt": "Portuguese Brazil",
    "Inicio": "Home",
    "Sobre": "About",
    "Projetos": "Projects",
    "Contato": "Contact",
    "Profissao": "Front-End Developer",
    "QuemSouEu": "Hello, I'm Josué Carvalho and I'm a FullStack Developer.",
    "DownloadCv": "Download CV",
    "SobreP1": "My name is Josué Carvalho, I'm a career-transitioning front-end developer, 22 years old, and I have advanced English skills. Currently, I'm focused on enhancing my skills in React JS, one of the leading JavaScript libraries for user interface development.",
    "SobreP2": "Full stack developer with comprehensive experience in Node.js, TypeScript, and React. My skills encompass development on both the server and user interface sides, enabling me to create integrated and efficient solutions. I am committed to continually improving my technical competencies, seeking challenging opportunities to contribute my expertise to innovative projects.",
    "habilidades": "Skills",
    "Visitar": "Visit application",
    "Codigo": "Code",
    "Telefone": "Cellphone to contact",
    "Email": "E-mail to contact",
    "Clique": "Click here to go!",
    "Linkedin": "My Linkedin",
    "Carregando": "Loading....",
    "calculadoraimc": "BMI Calculator",
    "Created at:": "Created at:",
    "Controle-Financeiro": "Financial Control",
    "Conversor-de-Moedas": "Currency Converter",
    "Teste técnico da empresa MKS Sistemas, utilizando React, Typescript, styled-components, react-query, react-helmet e react-router-dom.": "Technical testing by MKS Sistemas, using React, Typescript, styled-components, react-query, react-helmet and react-router-dom.",
    "Front end completo de um sistema de catalogo desenvolvido em React.js junto com o typescript e utilizando as seguintes bibliotecas: React Router, Context API, custom hooks, Axios, js-cookies e entre muitos outros recursos.": "Complete front end of a catalog system developed in React.js along with typescript and using the following libraries: React Router, Context API, custom hooks, Axios, js-cookies and many other resources.",
    "A CatalogoAPI é uma API Node.js com Express que oferece autenticação segura, envio de e-mails, validação, armazenamento em S3 da AWS e MongoDB para gerenciar um catálogo único com segurança e eficiência.": "CatalogoAPI is a Node.js API with Express that offers secure authentication, email sending, validation, storage in AWS S3 and MongoDB to manage a single catalog securely and efficiently.",
    "Backend desenvolvido em NodeJS com o framework ExpressJS para o app task manager. O backend conciste em um sistema de autenticação aonde após o usuário criar sua conta ele consegue utilizar o app para gerenciar suas tarefas.": "Backend developed in Node.js with the Express.js framework for the task manager app. The backend consists of an authentication system where, after the user creates their account, they can use the app to manage their tasks.",
    "O TaskManager é uma poderosa ferramenta de gerenciamento de tarefas que permite aos usuários criar perfis de usuário, adicionar, editar, excluir e gerenciar tarefas de forma eficiente. Com uma interface intuitiva, este aplicativo simplifica a organização do seu dia a dia, garantindo que você esteja sempre no controle de suas responsabilidades.": "The TaskManager is a powerful task management tool that allows users to create user profiles, efficiently add, edit, delete, and manage tasks. With an intuitive interface, this application simplifies your daily organization, ensuring you're always in control of your responsibilities.",
    "O profile card foi meu primeiro projeto usando html e css3 no período em que eu estava aprendendo mais sobre linguagens de demarcação.": "The profile card was my first project using HTML and CSS3 during the period when I was learning more about markup languages.",
    "A Pokedex desenvolvida durante o curso de formação em JavaScript é um aplicativo que apresenta uma página inicial com os 10 primeiros Pokémon e um botão que carrega mais 5 Pokémon a cada clique. Cada card exibe o tipo do Pokémon e sua habilidade, proporcionando aos treinadores uma visão geral das informações básicas de cada Pokémon.": "The Pokedex developed during the JavaScript training course is an application that features a home page with the first 10 Pokémon and a button that loads an additional 5 Pokémon with each click. Each card displays the Pokémon's type and ability, providing trainers with an overview of each Pokémon's basic information.",
    "Um aplicativo React.js com Firebase para criar, editar, excluir e gerenciar postagens de blog, incluindo autenticação de usuários. Simplifique a criação e administração do seu blog pessoal.": "A React.js application with Firebase for creating, editing, deleting, and managing blog posts, including user authentication. Simplify the creation and management of your personal blog.",
    "A página web 'JC Soluções' é uma plataforma completa e informativa criada para mostrar meu trabalho como profissional de TI e promover meus serviços como desenvolvedor. Com um design atrativo, ela apresenta uma variedade de projetos recentes e oferece informações detalhadas sobre meus serviços.": "The 'JC Soluções' website is a comprehensive and informative platform created to showcase my work as an IT professional and promote my services as a developer. With an appealing design, it showcases a variety of recent projects and provides detailed information about my services.",
    "Um aplicativo para consultar informações sobre países, cidades e capitais de forma fácil e rápida. Explore o mundo em detalhes.": "An application to easily and quickly access information about countries, cities, and capitals. Explore the world in detail.",
    "O conversor de moedas que criei combina HTML, CSS3 e JavaScript, juntamente com uma API de moedas, oferecendo aos usuários uma ferramenta prática e intuitiva para realizar conversões monetárias em tempo real.": "The currency converter I created combines HTML, CSS3, and JavaScript, along with a currency API, providing users with a practical and intuitive tool for real-time currency conversions.",
    "A Calculadora IMC é uma aplicação simples, desenvolvida com HTML, CSS e JavaScript, que permite calcular rapidamente o Índice de Massa Corporal (IMC) de uma pessoa.": "The BMI Calculator is a simple application developed with HTML, CSS, and JavaScript that allows you to quickly calculate a person's Body Mass Index (BMI).",
    "Um aplicativo React simples para registrar entradas e despesas financeiras, calculando automaticamente o saldo e exibindo uma lista organizada das transações para uma gestão financeira eficaz. Ideal para controle financeiro pessoal.": "A simple React application for recording income and expenses, automatically calculating the balance, and displaying an organized list of transactions for effective financial management. Ideal for personal financial control.",
    "O app do tempo que criei é uma aplicação web responsiva, minimalista e intuitiva que utiliza HTML, CSS e JavaScript para exibir informações precisas sobre as condições climáticas em tempo real. ": "The weather app I created is a responsive, minimalist, and intuitive web application that uses HTML, CSS, and JavaScript to display accurate real-time weather conditions information."
  }
}
