{
    "translation": {
        "Footer": "Developed © Josue Carvalho",
        "Lang": "Choose a translation",
        "en": "English International",
        "pt": "Portuguese Brazil",
        "Inicio": "Home",
        "Sobre": "About",
        "Projetos": "Projects",
        "Contato": "Contact",
        "Profissao": "Front-End Developer",
        "QuemSouEu": "Hello, I'm Josué Carvalho. I'm a Front-End Developer and I work with React.",
        "DownloadCv": "Download CV",
        "SobreP1": "My name is Josué Carvalho, I'm a career-transitioning front-end developer, 21 years old, and I have advanced English skills. Currently, I'm focused on enhancing my skills in React JS, one of the leading JavaScript libraries for user interface development.",
        "SobreP2": "My background in physiotherapy brings a unique perspective to my work as a front-end developer, enabling me to create intuitive and accessible interfaces for end users. I am constantly seeking ways to enhance my technical skills and I am excited to find challenging opportunities where I can contribute to innovative projects and collaborate as part of a team, aiming to achieve exceptional results.",
        "habilidades": "Skills",
        "Visitar":"Visit application",
        "Codigo": "Code",
        "Telefone": "Cellphone to contact",
        "Email": "E-mail to contact",
        "Clique": "Click here to go!",
        "Linkedin": "My Linkedin",
        "Carregando": "Loading....",
        "Calculadora IMC": "BMI calculator",
        "O app do tempo que criei é uma aplicação web responsiva, minimalista e intuitiva que utiliza HTML, CSS e JavaScript para exibir informações precisas sobre as condições climáticas em tempo real. O app permite ao usuário visualizar informações como temperatura, umidade, velocidade do vento e previsão do tempo para os próximos dias, além de possuir ícones animados que mudam de acordo com as condições climáticas atuais. O usuário pode permitir o acesso à sua localização ou pesquisar por outras cidades para visualizar informações sobre o clima em diferentes locais. O app é totalmente responsivo e foi desenvolvido com foco na usabilidade e experiência do usuário.": "The weather app I created is a responsive, minimalist, and intuitive web application that utilizes HTML, CSS, and JavaScript to display accurate information about real-time weather conditions. The app allows users to view information such as temperature, humidity, wind speed, and weather forecast for the upcoming days. It also features animated icons that change according to the current weather conditions. Users can either allow access to their location or search for other cities to view weather information for different locations. The app is fully responsive and has been developed with a focus on usability and user experience.",
        "A Pokedex desenvolvida durante o curso de formação em JavaScript é um aplicativo que apresenta uma página inicial com os 10 primeiros Pokémon e um botão que carrega mais 5 Pokémon a cada clique. Cada card exibe o tipo do Pokémon e sua habilidade, proporcionando aos treinadores uma visão geral das informações básicas de cada Pokémon. A Pokedex oferece uma experiência simples e interativa para explorar uma variedade crescente de Pokémon.": "The Pokedex developed during the JavaScript training course is an application that features a home page displaying the first 10 Pokémon and a button that loads an additional 5 Pokémon with each click. Each card displays the type of Pokémon and its ability, providing trainers with a general overview of each Pokémon's basic information. The Pokedex offers a simple and interactive experience to explore a growing variety of Pokémon.",
        "A página web 'JC Soluções' é uma plataforma completa e informativa criada para mostrar meu trabalho como profissional de TI e promover meus serviços como desenvolvedor. Com um design atrativo, ela apresenta uma variedade de projetos recentes e oferece informações detalhadas sobre meus serviços. Além disso, a página possui um botão de redirecionamento para orçamentos e contato, facilitando a interação com potenciais clientes. 'JC Soluções' é a vitrine perfeita para apresentar meu trabalho e destacar as soluções que posso oferecer aos interessados em tecnologia da informação": "The 'JC Solutions' web page is a comprehensive and informative platform created to showcase my work as an IT professional and promote my services as a developer. With an attractive design, it features a variety of recent projects and provides detailed information about my services. Additionally, the page includes a redirect button for quotes and contact, facilitating interaction with potential clients. 'JC Solutions' is the perfect showcase to present my work and highlight the solutions I can offer to those interested in information technology.",
        "O conversor de moedas que criei combina HTML, CSS3 e JavaScript, juntamente com uma API de moedas, oferecendo aos usuários uma ferramenta prática e intuitiva para realizar conversões monetárias em tempo real. Com uma interface amigável, o aplicativo permite que os usuários informem os valores e selecione as moedas desejadas, obtendo resultados precisos e atualizados com apenas um clique.": "The currency converter I created combines HTML, CSS3, and JavaScript, along with a currency API, providing users with a practical and intuitive tool for real-time currency conversions. With a user-friendly interface, the application allows users to input values and select desired currencies, obtaining accurate and up-to-date results with just one click.",
        "O app Todo-List é uma ferramenta prática e funcional desenvolvida com HTML, CSS e JavaScript, projetada para ajudar os usuários a organizar suas tarefas diárias. Com recursos intuitivos, o aplicativo permite criar, excluir e marcar as tarefas como concluídas. Além disso, caso você clique acidentalmente em uma tarefa concluída, é possível desfazer a ação, garantindo maior flexibilidade e precisão na gestão das tarefas. Com uma interface amigável e recursos de interação eficientes, o Todo-List é uma solução eficaz para manter o controle das atividades diárias de forma fácil e conveniente.":"The Todo-List app is a practical and functional tool developed with HTML, CSS, and JavaScript, designed to help users organize their daily tasks. With intuitive features, the application allows users to create, delete, and mark tasks as completed. Additionally, if you accidentally click on a completed task, it is possible to undo the action, ensuring greater flexibility and accuracy in task management. With a user-friendly interface and efficient interaction features, the Todo-List is an effective solution for easily and conveniently keeping track of daily activities.",
        "A calculadora de IMC criada com HTML, CSS e JavaScript é uma ferramenta interativa que fornece aos usuários uma maneira fácil e rápida de calcular e monitorar seu Índice de Massa Corporal. Com uma interface intuitiva, basta inserir o peso e a altura para obter instantaneamente o resultado do IMC e sua classificação correspondente. É uma solução prática para avaliar a saúde e o peso corporal de forma eficiente.":"The BMI calculator created with HTML, CSS, and JavaScript is an interactive tool that provides users with an easy and fast way to calculate and monitor their Body Mass Index. With an intuitive interface, simply inputting weight and height will instantly generate the BMI result and its corresponding classification. It is a practical solution for efficiently assessing health and body weight."
    }
}