{
    "translation": {
        "Footer": "Desenvolvido © Josue Carvalho",
        "Inicio": "Inicio",
        "Lang": "Selecione uma tradução",
        "en": "Inglês International",
        "pt": "Português Brasil",
        "Sobre": "Sobre",
        "Projetos": "Projetos",
        "Contato": "Contato",
        "Profissao": "Desenvolvedor Front-End",
        "QuemSouEu": "Olá sou Josue Carvalho. Sou Desenvolvedor Front-End e trabalho com React.",
        "DownloadCv": "Baixar CV",
        "SobreP1": "Meu nome é Josué Carvalho, sou um desenvolvedor front-end em transição de carreira, com 21 anos de idade e possuo habilidades avançadas em inglês. Atualmente, estou focado em aprimorar minhas habilidades em React JS, uma das principais bibliotecas JavaScript para o desenvolvimento de interfaces de usuário.",
        "SobreP2": "Minha formação em fisioterapia traz uma perspectiva única para o meu trabalho como desenvolvedor front-end, permitindo que eu crie interfaces intuitivas e acessíveis para os usuários finais. Estou constantemente em busca de maneiras de aprimorar minhas habilidades técnicas e estou animado para encontrar oportunidades desafiadoras, onde eu possa contribuir para projetos inovadores e colaborar em equipe, visando alcançar resultados excepcionais.",
        "habilidades": "Skills",
        "Visitar":"Visitar Aplicação",
        "Codigo": "Código",
        "Telefone": "Telefone para contato",
        "Email": "E-Mail para contato",
        "Linkedin": "Meu Linkedin",
        "Carregando": "Carregando....",
        "Clique": "Clique aqui para acessar!!",
        "O app do tempo que criei é uma aplicação web responsiva, minimalista e intuitiva que utiliza HTML, CSS e JavaScript para exibir informações precisas sobre as condições climáticas em tempo real. O app permite ao usuário visualizar informações como temperatura, umidade, velocidade do vento e previsão do tempo para os próximos dias, além de possuir ícones animados que mudam de acordo com as condições climáticas atuais. O usuário pode permitir o acesso à sua localização ou pesquisar por outras cidades para visualizar informações sobre o clima em diferentes locais. O app é totalmente responsivo e foi desenvolvido com foco na usabilidade e experiência do usuário.": "O app do tempo que criei é uma aplicação web responsiva, minimalista e intuitiva que utiliza HTML, CSS e JavaScript para exibir informações precisas sobre as condições climáticas em tempo real. O app permite ao usuário visualizar informações como temperatura, umidade, velocidade do vento e previsão do tempo para os próximos dias, além de possuir ícones animados que mudam de acordo com as condições climáticas atuais. O usuário pode permitir o acesso à sua localização ou pesquisar por outras cidades para visualizar informações sobre o clima em diferentes locais. O app é totalmente responsivo e foi desenvolvido com foco na usabilidade e experiência do usuário.",
        "A Pokedex desenvolvida durante o curso de formação em JavaScript é um aplicativo que apresenta uma página inicial com os 10 primeiros Pokémon e um botão que carrega mais 5 Pokémon a cada clique. Cada card exibe o tipo do Pokémon e sua habilidade, proporcionando aos treinadores uma visão geral das informações básicas de cada Pokémon. A Pokedex oferece uma experiência simples e interativa para explorar uma variedade crescente de Pokémon.": "A Pokedex desenvolvida durante o curso de formação em JavaScript é um aplicativo que apresenta uma página inicial com os 10 primeiros Pokémon e um botão que carrega mais 5 Pokémon a cada clique. Cada card exibe o tipo do Pokémon e sua habilidade, proporcionando aos treinadores uma visão geral das informações básicas de cada Pokémon. A Pokedex oferece uma experiência simples e interativa para explorar uma variedade crescente de Pokémon.",
        "A página web 'JC Soluções' é uma plataforma completa e informativa criada para mostrar meu trabalho como profissional de TI e promover meus serviços como desenvolvedor. Com um design atrativo, ela apresenta uma variedade de projetos recentes e oferece informações detalhadas sobre meus serviços. Além disso, a página possui um botão de redirecionamento para orçamentos e contato, facilitando a interação com potenciais clientes. 'JC Soluções' é a vitrine perfeita para apresentar meu trabalho e destacar as soluções que posso oferecer aos interessados em tecnologia da informação": "A página web 'JC Soluções' é uma plataforma completa e informativa criada para mostrar meu trabalho como profissional de TI e promover meus serviços como desenvolvedor. Com um design atrativo, ela apresenta uma variedade de projetos recentes e oferece informações detalhadas sobre meus serviços. Além disso, a página possui um botão de redirecionamento para orçamentos e contato, facilitando a interação com potenciais clientes. 'JC Soluções' é a vitrine perfeita para apresentar meu trabalho e destacar as soluções que posso oferecer aos interessados em tecnologia da informação",
        "O conversor de moedas que criei combina HTML, CSS3 e JavaScript, juntamente com uma API de moedas, oferecendo aos usuários uma ferramenta prática e intuitiva para realizar conversões monetárias em tempo real. Com uma interface amigável, o aplicativo permite que os usuários informem os valores e selecione as moedas desejadas, obtendo resultados precisos e atualizados com apenas um clique.": "O conversor de moedas que criei combina HTML, CSS3 e JavaScript, juntamente com uma API de moedas, oferecendo aos usuários uma ferramenta prática e intuitiva para realizar conversões monetárias em tempo real. Com uma interface amigável, o aplicativo permite que os usuários informem os valores e selecione as moedas desejadas, obtendo resultados precisos e atualizados com apenas um clique.",
        "O app Todo-List é uma ferramenta prática e funcional desenvolvida com HTML, CSS e JavaScript, projetada para ajudar os usuários a organizar suas tarefas diárias. Com recursos intuitivos, o aplicativo permite criar, excluir e marcar as tarefas como concluídas. Além disso, caso você clique acidentalmente em uma tarefa concluída, é possível desfazer a ação, garantindo maior flexibilidade e precisão na gestão das tarefas. Com uma interface amigável e recursos de interação eficientes, o Todo-List é uma solução eficaz para manter o controle das atividades diárias de forma fácil e conveniente.":"O app Todo-List é uma ferramenta prática e funcional desenvolvida com HTML, CSS e JavaScript, projetada para ajudar os usuários a organizar suas tarefas diárias. Com recursos intuitivos, o aplicativo permite criar, excluir e marcar as tarefas como concluídas. Além disso, caso você clique acidentalmente em uma tarefa concluída, é possível desfazer a ação, garantindo maior flexibilidade e precisão na gestão das tarefas. Com uma interface amigável e recursos de interação eficientes, o Todo-List é uma solução eficaz para manter o controle das atividades diárias de forma fácil e conveniente.",
        "A calculadora de IMC criada com HTML, CSS e JavaScript é uma ferramenta interativa que fornece aos usuários uma maneira fácil e rápida de calcular e monitorar seu Índice de Massa Corporal. Com uma interface intuitiva, basta inserir o peso e a altura para obter instantaneamente o resultado do IMC e sua classificação correspondente. É uma solução prática para avaliar a saúde e o peso corporal de forma eficiente.":"A calculadora de IMC criada com HTML, CSS e JavaScript é uma ferramenta interativa que fornece aos usuários uma maneira fácil e rápida de calcular e monitorar seu Índice de Massa Corporal. Com uma interface intuitiva, basta inserir o peso e a altura para obter instantaneamente o resultado do IMC e sua classificação correspondente. É uma solução prática para avaliar a saúde e o peso corporal de forma eficiente."

    }
}